Repository: eduNEXT/xblock-controlled-navigation
Catalog: controlled_navigation/locale/*/LC_MESSAGES/text.po
Languages: es_es

source: Display Name
es_es: Nombre a Mostrar

source: The display name for this component.
es_es: El nombre a mostrar para este componente.

source: Content with Controlled Navigation
es_es: Contenido con Navegación Controlada

source: Randomness
es_es: Aleatoriedad

source: When enabled, the children of the component will be displayed in a random order.
es_es: Cuando está habilitado, los hijos del componente se mostrarán en un orden aleatorio.

source: Subset Size
es_es: Tamaño del Subconjunto

source: When randomness is enabled, allows choose a subset of the total number of children components. If set to 0, it will display all children components. NOTE: This settingis only updated the first time the component is used.
es_es: Cuando la aleatoriedad está habilitada, permite elegir un subconjunto del número total de componentes hijos. Si se establece en 0, mostrará todos los componentes hijos. NOTA: Esta configuración solo se actualiza la primera vez que se utiliza el componente.

source: Forward Navigation Only
es_es: Solo Navegación Hacia Adelante

source: When enabled, the student can only navigate forward through the components' children.
es_es: Cuando está habilitado, el estudiante solo puede navegar hacia adelante a través de los hijos del componente.

source: Next Button Text
es_es: Texto del Botón Siguiente

source: Text for the next button used to navigate forward through the components' children.
es_es: Texto para el botón siguiente utilizado para navegar hacia adelante a través de los hijos del componente.

source: Next Question
es_es: Siguiente Pregunta

source: Previous Button Text
es_es: Texto del Botón Anterior

source: Text for the previous button used to navigate back through the components' children.
es_es: Texto para el botón anterior utilizado para navegar hacia atrás a través de los hijos del componente.

source: Previous Question
es_es: Pregunta Anterior
